# 姓名  年龄  性别  编号   任职公司   薪资   部门编号
names = [
    ["曹操","56","男","106","IBM", 500 ,"50"],
    ["大乔","19","女","230","微软", 501 ,"60"],
    ["小乔", "19", "女", "210", "Oracle", 600, "60"],
    ["许褚", "45", "男", "230", "Tencent", 700 , "10"]
]


a=["刘备","45","男","220","alibaba","500","30"]
names.append(a)
print(names)

i=0
a=0
v=0
while i<5:
    if names[i][2]=="男":
        a=a+1
    elif names[i][2]=="女":
        v=v+1
    i=i+1


print("公司男士人数为：%d"%a)
print("公司女士人数为：%d"%v)
