# 姓名  年龄  性别  编号   任职公司   薪资   部门编号
names = [
        ["罗恩", 23 ,35 ,44],
        ["哈利" ,60, 77 ,68 ,88, 90],
        ["赫敏", 97 ,99 ,89 ,91, 95, 90],
        ["马尔福 ",100, 85 ,90]
]


i = 0
s=0
n=0
while i < 4:
        del names[i][0]
        while n < len(names[i]):
                s = int(names[i][n]) + s
                n = n + 1
        names = [
                ["罗恩", 23, 35, 44],
                ["哈利", 60, 77, 68, 88, 90],
                ["赫敏", 97, 99, 89, 91, 95, 90],
                ["马尔福 ", 100, 85, 90]
        ]
        print(names[i][0],"的个人的总成绩为%d："%s)
        s=0
        n=0
        i = i + 1